import React, { Component } from "react";

class ClosedCaption extends Component {
  render() {
    return (
      <React.Fragment>
        <div className="container pt-1">
          <h2 className="heading-bar tb">Closed Captions</h2>
        </div>
        <textarea
          ref={this.props.closedCaptionRef}
          value="ان مذاکرات کی معطلی کی وجہ بظاہر مذاکرات کے دوران کابل میں ایک حملہ بتائی گئی تھی تاہم افغان حکومت نے اس موقع پر کہا تھا کہ وہ دیرپا امن کے لیے پرعزم ہیں۔ انھوں نے امریکی حکومت سے مطالبہ کیا تھا کہ وہ ان کے ساتھ مل کر قیام امن کے لیے کام کریں۔ بعدازاں دسمبر 2019 میں امریکی نمائندہ خصوصی برائے افغان مفاہمتی عمل زلمے خلیل زاد نے قطر میں دوبارہ مذاکرات شروع کیے تھے۔ امریکہ اور افغان طالبان کے درمیان مذاکرات مکمل ہو چکے ہیں اور دونوں جانب سے مذاکرات کامیاب قرار دیے جا چکے ہیں جس کے نتیجے میں امریکہ افغانستان سے بتدریج اپنی فوجیں نکالے گا اور اسے ایک محفوظ راستہ چاہیے ہو گا۔ مبصرین کے مطابق اس معاہدے سے جہاں امریکہ افغانستان میں اپنی طویل جنگ کو اختتام دے سکے گا وہیں افغان حکومت کے لیے اس کے بعد کٹھن فیصلے ہوں گے۔ افغانستان میں انتخابات کے نتائج کا باقاعدہ اعلان کر دیا گیا ہے جن میں اشرف غنی کامیاب رہے۔ اشرف غنی کے مخالف عبداللہ عبداللہ نے ان نتائج کو تسلیم کرنے سے انکار کر دیا ہے اور کہا ہے کہ وہ اپنی حکومت قائم کریں گے۔ مگر کیا طالبان ان انتخابی نتائج کو تسلیم کریں گے؟ اور ایسی کسی بھی صورتحال کے پیدا ہونے سے امریکہ کا کیا رد عمل ہو سکتا ہے؟ صدر اشرف غنی نے چند روز پہلے کہا تھا کہ دوحہ میں امریکہ اور طالبان کے درمیان معاہدہ کامیابی سے ہمکانار ہونا چاہیے۔ پاکستان کے وزیر خارجہ شاہ محمود قریشی نے بھی چند روز پہلے کہا تھا کہ امریکہ اور طالبان کو اس سنہری موقع سے فائدہ اٹھانا چاہیے اور جلد از جلد اس معاہدے کو عملی شکل دینی چاہیے تاکہ خطے ریجن میں امن قائم ہو سکے اور ایسے عناصر کو موقع نہیں ملنا چاہیے جو اس امن کے قیام کی راہ میں رکاوٹ بننا چاہتے ہیں۔ان مذاکرات کی معطلی کی وجہ بظاہر مذاکرات کے دوران کابل میں ایک حملہ بتائی گئی تھی تاہم افغان حکومت نے اس موقع پر کہا تھا کہ وہ دیرپا امن کے لیے پرعزم ہیں۔ انھوں نے امریکی حکومت سے مطالبہ کیا تھا کہ وہ ان کے ساتھ مل کر قیام امن کے لیے کام کریں۔ بعدازاں دسمبر 2019 میں امریکی نمائندہ خصوصی برائے افغان مفاہمتی عمل زلمے خلیل زاد نے قطر میں دوبارہ مذاکرات شروع کیے تھے۔ امریکہ اور افغان طالبان کے درمیان مذاکرات مکمل ہو چکے ہیں اور دونوں جانب سے مذاکرات کامیاب قرار دیے جا چکے ہیں جس کے نتیجے میں امریکہ افغانستان سے بتدریج اپنی فوجیں نکالے گا اور اسے ایک محفوظ راستہ چاہیے ہو گا۔ مبصرین کے مطابق اس معاہدے سے جہاں امریکہ افغانستان میں اپنی طویل جنگ کو اختتام دے سکے گا وہیں افغان حکومت کے لیے اس کے بعد کٹھن فیصلے ہوں گے۔ افغانستان میں انتخابات کے نتائج کا باقاعدہ اعلان کر دیا گیا ہے جن میں اشرف غنی کامیاب رہے۔ اشرف غنی کے مخالف عبداللہ عبداللہ نے ان نتائج کو تسلیم کرنے سے انکار کر دیا ہے اور کہا ہے کہ وہ اپنی حکومت قائم کریں گے۔ مگر کیا طالبان ان انتخابی نتائج کو تسلیم کریں گے؟ اور ایسی کسی بھی صورتحال کے پیدا ہونے سے امریکہ کا کیا رد عمل ہو سکتا ہے؟ صدر اشرف غنی نے چند روز پہلے کہا تھا کہ دوحہ میں امریکہ اور طالبان کے درمیان معاہدہ کامیابی سے ہمکانار ہونا چاہیے۔ پاکستان کے وزیر خارجہ شاہ محمود قریشی نے بھی چند روز پہلے کہا تھا کہ امریکہ اور طالبان کو اس سنہری موقع سے فائدہ اٹھانا چاہیے اور جلد از جلد اس معاہدے کو عملی شکل دینی چاہیے تاکہ خطے ریجن میں امن قائم ہو سکے اور ایسے عناصر کو موقع نہیں ملنا چاہیے جو اس امن کے قیام کی راہ میں رکاوٹ بننا چاہتے ہیں۔"
          disabled={true}
          className="textarea"
          dir="rtl"
        ></textarea>
      </React.Fragment>
    );
  }
}

export default ClosedCaption;
