import React, { Component } from "react";

class NewsTickerPanel extends Component {
  state = {};

  async componentDidMount() {
    this.props.socket.on("TickerRecognitionClient", (data) => {
      console.log("Data from TickerRecognition Module :", data);
    });
  }

  render() {
    return (
      <React.Fragment>
        <div className="container pb-1">
          <h2 className="heading-bar tb">News Tickers</h2>
        </div>
        <marquee behavior="scroll" className="ticker-1" direction="right">
          پاکستان پولیس کے سینئر افسر، سپرنٹینڈنٹ پولیس مفخرعدیل بدھ کے روز
          لاہور کے علاقے جوہر ٹاؤن سے ’لاپتہ‘ ہو گئے ہیں۔ لاہور پولیس کے سربراہ
          نے کہا ہے کہ پولیس افسر مفخر عدیل اغو نہیں ہوئے ہیں بلکہ وہ ’لاپتہ‘
          ہیں۔ تاہم ابھی تک (ایس ایس پی) مفخر عدیل کے لاپتہ ہونے کا مقدمہ درج
          نہیں گیا۔ پولیس افسر کے لاپتہ ہونے سے متعلق جب بی بی سی نے سی سی پی او
          لاہور ذوالفقار حمید سے رابطہ کیا تو انھوں نے کہا کہ وہ فی الحال اس کیس
          پر کوئی رائے نہیں دینا چاہتے۔
        </marquee>

        <marquee behavior="scroll" className="ticker-2" direction="right">
          پاکستان پولیس کے سینئر افسر، سپرنٹینڈنٹ پولیس مفخرعدیل بدھ کے روز
          لاہور کے علاقے جوہر ٹاؤن سے ’لاپتہ‘ ہو گئے ہیں۔ لاہور پولیس کے سربراہ
          نے کہا ہے کہ پولیس افسر مفخر عدیل اغو نہیں ہوئے ہیں بلکہ وہ ’لاپتہ‘
          ہیں۔ تاہم ابھی تک (ایس ایس پی) مفخر عدیل کے لاپتہ ہونے کا مقدمہ درج
          نہیں گیا۔ پولیس افسر کے لاپتہ ہونے سے متعلق جب بی بی سی نے سی سی پی او
          لاہور ذوالفقار حمید سے رابطہ کیا تو انھوں نے کہا کہ وہ فی الحال اس کیس
          پر کوئی رائے نہیں دینا چاہتے۔
        </marquee>

        <div></div>
        <marquee behavior="scroll" className="ticker-3" direction="right">
          پاکستان پولیس کے سینئر افسر، سپرنٹینڈنٹ پولیس مفخرعدیل بدھ کے روز
          لاہور کے علاقے جوہر ٹاؤن سے ’لاپتہ‘ ہو گئے ہیں۔ لاہور پولیس کے سربراہ
          نے کہا ہے کہ پولیس افسر مفخر عدیل اغو نہیں ہوئے ہیں بلکہ وہ ’لاپتہ‘
          ہیں۔ تاہم ابھی تک (ایس ایس پی) مفخر عدیل کے لاپتہ ہونے کا مقدمہ درج
          نہیں گیا۔ پولیس افسر کے لاپتہ ہونے سے متعلق جب بی بی سی نے سی سی پی او
          لاہور ذوالفقار حمید سے رابطہ کیا تو انھوں نے کہا کہ وہ فی الحال اس کیس
          پر کوئی رائے نہیں دینا چاہتے۔
        </marquee>
      </React.Fragment>
    );
  }
}

export default NewsTickerPanel;
